{
  "agenda_number": 69,
  "source_file": "Agenda_69.txt",
  "extracted_data": {
    "meeting_info": {
      "date": "February 18, 2025",
      "time": "9:00 AM",
      "type": "Regular Meeting",
      "organization": "Quality of Life, Arts, and Culture Committee",
      "location": "Council Chambers, 6th Floor, City Hall, 1500 Marilla Street, Dallas, Texas 75201"
    },
    "attendees": {
      "chair": "Paul E. Ridley",
      "presenters": [
        "Kyle Ogden, President and Chief Executive Officer, The Thanks-Giving Foundation",
        "Heather Lowe, Interim Director, Dallas Public Library",
        "Martine Elyse Philippe, Director, Office of Arts and Culture",
        "Jennifer Nicewander, Director, Office of Bond and Construction Management"
      ],
      "participants": [
        "Luis Loya, Management Analyst, City Manager’s Office",
        "Sean McGrew, Assistant Director, Dallas Public Library",
        "Kjerstine Nielsen-Pelto, Assistant Director, Dallas Public Library",
        "Sallie Lockhart, Assistant Director, Dallas Public Library",
        "Glenn Ayars, Assistant Director, Office of Arts and Culture",
        "Russell Dyer, Superintendent of Facilities, Office of Arts and Culture",
        "Candi Green, Assistant Director, Office of Bond and Construction Management"
      ]
    },
    "agenda_items": [
      {
        "item_number": "1",
        "title": "Establishment of The Thanks-Giving Square District at Thanks-Giving Square",
        "description": "Discussion on the significance and future aspirations of the Thanks-Giving Square District.",
        "presenter": "Kyle Ogden",
        "action_required": "Discuss and endorse the project"
      },
      {
        "item_number": "2",
        "title": "Developing a Quality of Life Strategy - Library Strategic Plan",
        "description": "Updates on the Library's strategic plan and its alignment with city priorities.",
        "presenter": "Heather Lowe",
        "action_required": "Review and discuss progress"
      },
      {
        "item_number": "3",
        "title": "City Facilities Partners Update - Dallas Museum of Art",
        "description": "Update on the partnership and management agreement with the Dallas Museum of Art.",
        "presenter": "Martine Elyse Philippe",
        "action_required": "Review and discuss updates"
      },
      {
        "item_number": "4",
        "title": "Public Restroom Accessibility Renovations at Various City Facilities",
        "description": "Request to authorize a design-build construction contract for restroom accessibility renovations.",
        "presenter": "Jennifer Nicewander",
        "action_required": "Authorize contract"
      }
    ],
    "keywords": [
      "Quality of Life",
      "Arts and Culture",
      "Thanks-Giving Square",
      "Library Strategic Plan",
      "Dallas Museum of Art",
      "Public Restroom Accessibility",
      "Community Engagement",
      "Cultural Programming",
      "City Facilities",
      "Equity and Inclusion"
    ],
    "financial_items": [
      {
        "description": "Design-build construction contract for public restroom accessibility renovations",
        "amount": "$567,224.00",
        "type": "expenditure"
      }
    ]
  },
  "extraction_method": "openai_gpt",
  "original_length": 367419
}