{
  "agenda_number": 155,
  "source_file": "Agenda_155.txt",
  "extracted_data": {
    "meeting_info": {
      "date": "December 12, 2024",
      "time": null,
      "type": "Regular Meeting",
      "organization": "Recreation Board",
      "location": "Dallas City Hall"
    },
    "attendees": {
      "chair": null,
      "presenters": [],
      "participants": []
    },
    "agenda_items": [
      {
        "item_number": "9",
        "title": "State Fair of Texas Annual Report  – Rachael Berry, Assistant Director",
        "description": "State Fair of Texas Annual Report  – Rachael Berry, Assistant Director",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "10",
        "title": "Update on Enhancements & Improvements at White Rock Lake",
        "description": "Update on Enhancements & Improvements at White Rock Lake",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "1",
        "title": "seeking the advice of its attorney about pending or contemplated litigation, settlement offers, or a...",
        "description": "seeking the advice of its attorney about pending or contemplated litigation, settlement offers, or any matter in which the duty of  \n\n         the attorney to the City Council under the Texas Disciplinary Rules of Professional Conduct of the State Bar of Texas clearly  \n\n         conflicts with the Texas Open Meetings Act. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "2",
        "title": "deliberating the purchase, exchange, lease, or value of real property if deliberation in an open mee...",
        "description": "deliberating the purchase, exchange, lease, or value of real property if deliberation in an open meeting would have a detrimental  \n\n         effect on the position of the city in negotiations with a third person. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "3",
        "title": "deliberating a negotiated contract for a prospective gift or donation to the city if deliberation in...",
        "description": "deliberating a negotiated contract for a prospective gift or donation to the city if deliberation in an open meeting would have a  \n\n         detrimental effect on the position of the city in negotiations with a third person. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "4",
        "title": "deliberating  the  appointment,  employment,  evaluation,  reassignment,  duties,  discipline,  or  ...",
        "description": "deliberating  the  appointment,  employment,  evaluation,  reassignment,  duties,  discipline,  or  dismissal  of  a  public  officer  or  \n\n         employee; or to hear a complaint or charge against an officer or employee unless the officer or employee who is the subject of  \n\n         the deliberation or hearing requests a public hearing. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "5",
        "title": "deliberating  the  deployment,  or  specific  occasions  for  implementation,  of  security  personn...",
        "description": "deliberating  the  deployment,  or  specific  occasions  for  implementation,  of  security  personnel  or  devices.  [Tex.  Govt.  Code  \n\n         §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "6",
        "title": "discussing or deliberating commercial or financial information that the city has received from a bus...",
        "description": "discussing or deliberating commercial or financial information that the city has received from a business prospect that the city  \n\n         seeks to have locate, stay or expand in or near the city and with which the city is conducting economic development negotiations;  \n\n         or deliberating the offer of a financial or other incentive to a business prospect. [Tex Govt . Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "7",
        "title": "deliberating security assessments or deployments relating to information resources technology, netwo...",
        "description": "deliberating security assessments or deployments relating to information resources technology, network security information, or  \n\n         the deployment or specific occasions for implementations of security personnel, critical infrastructure, or security devices. [Tex  \n\n         Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      }
    ],
    "keywords": [
      "tif",
      "budget",
      "approval",
      "public",
      "development",
      "improvement",
      "transportation",
      "resolution",
      "contract",
      "agreement"
    ],
    "financial_items": []
  },
  "extraction_method": "openai_gpt",
  "original_length": 16196
}