{
  "agenda_identifier": "agenda_20250220_regular_02",
  "agenda_number": 20250220,
  "source_file": "agenda_20250220_regular_02.txt",
  "extracted_data": {
    "meeting_info": {
      "date": "February 20, 2025",
      "time": null,
      "type": "Regular Meeting",
      "organization": "Recreation Board",
      "location": "Dallas City Hall"
    },
    "attendees": {
      "chair": null,
      "presenters": [],
      "participants": []
    },
    "agenda_items": [
      {
        "item_number": "113",
        "title": "hábiles antes de la  reunión programada. Una transmisión  \n\n                                        ...",
        "description": "hábiles antes de la  reunión programada. Una transmisión  \n\n                                                                         en video de la reunión estará disponible dos días hábiles  \n\n                                                                         luego    de    la   finalización   de    la   reunión    en  \n\n                                                                         https://dallastx.new.swagit.com/views/",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "15",
        "title": "seeking the advice of its attorney about pending or contemplated litigation, settlement offers, or a...",
        "description": "seeking the advice of its attorney about pending or contemplated litigation, settlement offers, or any matter in which  \n\n      the duty of the attorney to the City Council under the Texas Disciplinary Rules of Professional Conduct of the State  \n\n      Bar of Texas clearly conflicts with the Texas Open Meetings Act. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "16",
        "title": "deliberating the purchase, exchange, lease, or value of real property if deliberation in an open mee...",
        "description": "deliberating the purchase, exchange, lease, or value of real property if deliberation in an open meeting would have  \n\n      a detrimental effect on the position of the city in negotiations with a third person. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "17",
        "title": "deliberating a negotiated contract for a prospective gift or donation to the city if deliberation in...",
        "description": "deliberating a negotiated contract for a prospective gift or donation to the city if deliberation in an open meeting  \n\n      would have a detrimental effect on the position of the city in negotiations with a third person. [Tex. Govt. Code  \n\n      §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "18",
        "title": "deliberating the appointment, employment, evaluation, reassignment, duties, discipline, or dismissal...",
        "description": "deliberating the appointment, employment, evaluation, reassignment, duties, discipline, or dismissal of a public  \n\n      officer or employee; or to hear a complaint or charge against an officer or employee unless the officer or employee  \n\n      who is the subject of the deliberation or hearing requests a public hearing. [Tex. Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "19",
        "title": "deliberating the deployment, or specific occasions for implementation, of security personnel or devi...",
        "description": "deliberating the deployment, or specific occasions for implementation, of security personnel or devices. [Tex. Govt.  \n\n      Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "20",
        "title": "discussing or deliberating commercial or financial information that the city has received from a bus...",
        "description": "discussing or deliberating commercial or financial information that the city has received from a business prospect  \n\n      that the city seeks to have locate, stay or expand in or near the city and with which the city is conducting economic  \n\n      development negotiations; or deliberating the offer of a financial or other incentive to a business prospect. [Tex  \n\n      Govt . Code §",
        "presenter": null,
        "action_required": "Action"
      },
      {
        "item_number": "21",
        "title": "deliberating security assessments or deployments relating to information resources technology, netwo...",
        "description": "deliberating security assessments or deployments relating to information resources technology, network security  \n\n      information,  or   the   deployment   or   specific   occasions   for   implementations   of   security  personnel,  critical  \n\n      infrastructure, or security devices. [Tex Govt. Code §",
        "presenter": null,
        "action_required": "Action"
      }
    ],
    "keywords": [
      "tif",
      "district",
      "funding",
      "approval",
      "public",
      "development",
      "contract"
    ],
    "financial_items": []
  },
  "extraction_method": "openai_gpt",
  "original_length": 12387
}