{
  "agenda_identifier": "agenda_20240826_budget",
  "agenda_number": 20240826,
  "source_file": "agenda_20240826_budget.txt",
  "summary": "**Meeting Overview**:  \nThe Housing and Homelessness Solutions Committee of the Dallas City Council is convening on August 26, 2024, at 9:00 AM. The meeting will be held both in-person at City Hall and via video conference, with the purpose of discussing housing initiatives and homelessness solutions in Dallas.\n\n**Key Agenda Items**:  \n1. Approval of minutes from the June 24, 2024 meeting.\n2. Briefings on various housing projects and updates from the Office of Homeless Solutions and the Department of Housing and Neighborhood Revitalization.\n3. Discussion of upcoming public hearings and city council agenda items related to housing finance and homeless services.\n\n**Important Details**:  \n- A presentation on the Public Facility Corporation will be provided.\n- Updates on specific properties related to homelessness solutions will be shared.\n- The committee will review the Dallas Housing Policy 2033 implementation and performance measures for the Department of Housing & Neighborhood Revitalization.\n- Several public hearings are scheduled for September 25, 2024, regarding applications for Low Income Housing Tax Credits and the acquisition of a multifamily development.\n\n**Action Items**:  \nThe committee will seek approval for several key items on the upcoming city council agenda, including:\n- An interlocal agreement with Dallas County for $1,000,000 to support homeless assistance services.\n- Acceptance of a $1,052,503 grant from TDHCA for homeless services.\n- Authorization of a service contract with Bridge Steps for immediate housing solutions.\n- Amendments to existing contracts for homeless shelter management and service assistance for young adults.\n\nThe meeting will conclude with an opportunity for executive session if necessary.",
  "original_length": 30635,
  "summary_length": 1753,
  "processed_at": "286529.641399541"
}