{
  "agenda_identifier": "agenda_20240611_regular",
  "agenda_number": 20240611,
  "source_file": "agenda_20240611_regular.txt",
  "summary": "**Meeting Overview**:  \nThe Dallas Housing Finance Corporation (DHFC) will hold a regular meeting on June 11, 2024, at 12:00 PM at Dallas City Hall and via videoconference. The purpose of the meeting is to discuss and make decisions regarding housing finance initiatives, including the approval of financing resolutions for multifamily residential developments and updates on the Corporation's financial activities.\n\n**Key Agenda Items**:  \n1. Approval of the minutes from the previous meeting on May 14, 2024.  \n2. Action items concerning the West Virginia Apartments, including financing resolutions for a multifamily development.  \n3. Renewal of the Corporation’s participation in the single-family home mortgage program.\n\n**Important Details**:  \n- The DHFC will consider a financing resolution for the West Virginia Apartments, authorizing the issuance of up to $32 million in tax-exempt bonds to fund rehabilitation efforts. This includes approving necessary partnership resolutions for the development's financing structure involving multiple financial institutions.  \n- The meeting will also address the renewal of the Corporation's single-family mortgage program, including an assignment agreement with the Texas Department of Housing and Community Affairs and an application for a bond allocation of up to $64.8 million.\n\n**Action Items**:  \n- Approval of the minutes from the previous meeting.  \n- Adoption of financing resolutions for the West Virginia Apartments and associated partnership agreements.  \n- Approval of the assignment agreement with TDHCA and the application for the single-family bond allocation.  \n\nThe meeting will also include public comments and discussions on the DHFC Treasurer’s report and the Corporation’s pipeline report.",
  "original_length": 12505,
  "summary_length": 1760,
  "processed_at": "265088.653165666"
}