{
  "agenda_identifier": "agenda_20240220_committee",
  "agenda_number": 20240220,
  "source_file": "agenda_20240220_committee.txt",
  "summary": "**Meeting Overview**:  \nThe Transportation and Infrastructure Committee of the City of Dallas will convene on February 20, 2024, at 1:00 PM, in the Council Chambers at City Hall. The meeting will be held both in-person and via video conference, allowing public attendance virtually or in person. The primary purpose is to discuss transportation and infrastructure initiatives, review past meeting minutes, and consider various proposals and updates.\n\n**Key Agenda Items**:  \n1. Approval of the minutes from the January 16, 2023, meeting.\n2. Briefing on the Vision Zero Plan.\n3. Updates on Oncor streetlight maintenance and LED replacements.\n4. Discussion of a TxDOT agreement for the DART Victory Station pedestrian crossing.\n5. Monthly performance update on Public Works programs.\n\n**Important Details**:  \n- A five-year master agreement for airfield lighting fixtures is proposed, estimated at $932,500.\n- The sale of approximately 1,112 square feet of unwanted city land is planned, expected to generate $13,344 for the General Fund.\n- A construction services contract for the Five Mile Infrastructure Improvements Package A is proposed, not to exceed $11,564,976.75, funded through various city funds.\n- A revised Public Transportation Agency Safety Plan for the Dallas Streetcar System is to be adopted.\n\n**Action Items**:  \nThe committee seeks approval for several contracts and agreements, including:\n- Authorization for the airfield lighting agreement.\n- Approval of the sale of city-owned land.\n- Endorsement of the construction services contracts for infrastructure improvements.\n- Adoption of the revised safety plan for the streetcar system. \n\nThe meeting will also include an executive session if necessary to discuss legal or property matters.",
  "original_length": 28900,
  "summary_length": 1757,
  "processed_at": "283409.944908416"
}